# Завдання 3 (необов'язкове завдання)

# У багатьох мовах програмування ми маємо справу з виразами, 
# виділеними символами-розділювачами, такими як круглі ( ), 
# квадратні [ ] або фігурні дужки { }.


# Напишіть програму, яка читає рядок з послідовністю символів-розділювачів, 
# наприклад, ( ) { [ ] ( ) ( ) { } } }, і надає відповідне повідомлення, 
# коли розділювачі симетричні, несиметричні, наприклад ( ( ( ) , 
# або коли розділювачі різних видів стоять у парі, як-от ( }.


def is_symmetric(s):
    stack = []
    opening = "({["
    closing = ")}]"
    matches = {")": "(", "}": "{", "]": "["}

    for char in s:
        if char in opening:
            stack.append(char)
        elif char in closing:
            if stack and stack[-1] == matches[char]:
                stack.pop()
            else:
                return "Несиметрично"

    return "Симетрично" if not stack else "Несиметрично"


def task3():
    inputs = ["(){[1 1](1 + 3)(){}}", "(23(2 - 3));", "(11})"]

    for inp in inputs:
        result = is_symmetric(inp)
        print(f"{inp}: {result}")


if __name__ == "__main__":
    task3()
